Unable to create form element: self-intersecting or singular geometry would result.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FormElemRegenSelfIntersection { get; }
  Visual Basic
Public Shared ReadOnly Property FormElemRegenSelfIntersection As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersection {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FormFailures Class
  Autodesk.Revit.DB Namespace